{"index": {"_index": "new_index"}}
{"product_id": "product_en_0740675", "stars": 5, "reviews" :[ { "review_body": "Arrived broken. Manufacturer defect. Two of the legs of the base were not completely formed, so there was no way to insert the casters. I unpackaged the entire chair and hardware before noticing this. So, I'll spend twice the amount of time boxing up the whole useless thing and send it back with a 1-star review of part of a chair I never got to sit in. I will go so far as to include a picture of what their injection molding and quality assurance process missed though. I will be hesitant to buy again. It makes me wonder if there aren't missing structures and supports that don't impede the assembly process.", "review_title": "I'll spend twice the amount of time boxing up the whole useless thing and send it back with a 1-star review ...", "language": "sin", "product_category": "furniture", "published_date": "10/03/2022"}]}
{"index": {"_index": "new_index"}}
{"product_id":"product_en_0740675","stars":5,"reviews":[{"review_body":"By carefully reviewing these points and possibly providing more specific details about your setup and any error messages you encounter, you can troubleshoot and resolve issues with nested searches using the Sinhala search analyzer in Elasticsearch more effectively. If you encounter specific errors or issues, feel free to share them for more targeted assistance.","review_title":"Certainly, let's continue discussing possible solutions for issues with nested searches for the Sinhala search analyzer:","language":"sin","product_category":"furniture","published_date":"10/03/2022"}]}
{"index": {"_index": "new_index"}}
{"product_id":"product_en_0740675","stars":5,"reviews":[{"review_body":" If you're not explicitly specifying the mappings, Elasticsearch might be using dynamic mapping. Dynamic mapping can sometimes result in unexpected field types or analyzers. Consider using explicit mappings to ensure the desired configuration.Elasticsearch Logs: Check Elasticsearch's logs for any error messages or warnings related to the search and indexing processes. Logs can provide valuable insights into what might ","review_title":"I'll spend twice the amount of time boxing up the whole useless thing and send it back with a 1-star review ...","language":"sin","product_category":"furniture","published_date":"10/03/2022"}]}
